Revit 2024 API
ThermalAsset.TransmitsLight Property
 A boolean flag that indicates whether or not the asset transmits light.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool TransmitsLight { get; set; }
Visual Basic
Public Property TransmitsLight As Boolean
	Get
	Set
Visual C++
public:
property bool TransmitsLight {
	bool get ();
	void set (bool value);
}
See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace